app/controllers/galleries_controller.rb

INSERT INTO "galleries" ("name", "city", "state", "zip", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @gallery = Gallery.new(params_strong)
    if @gallery.save